/*
*********************************************************************************************************
*
*	模块名称 : Flash配置
*	文件名称 : Dev_Inf.c
*	版    本 : V1.0
*	说    明 : Flash配置
*
*	修改记录 :
*		版本号  日期         作者       说明
*		V1.0    2020-11-06  Eric2013   正式发布
*
*	Copyright (C), 2020-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
#include "Dev_Inf.h"


#if defined (__ICCARM__)
__root struct StorageInfo const StorageInfo  =  {
#else
struct StorageInfo const StorageInfo =  {
#endif
    "ARMFLY_STM32H743_SPI_W25Q64", /* 算法名，添加算法到STM32CubeProg安装目录会显示此名字 */
    NOR_FLASH,                      /* 设备类型 */
    0xC0000000,                     /* Flash起始地址 */
    8 * 1024 * 1024,                /* Flash大小，8MB */
    4096,                           /* 编程页大小 */
    0xFF,                           /* 擦除后的数值 */
    2048 , 4 * 1024,                /* 块个数和块大小 */
    0x00000000, 0x00000000,
};

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
