/*
*********************************************************************************************************
*
*	模块名称 : Event Recorder测试模块。
*	文件名称 : EventRecorderTest.c
*	版    本 : V1.0
*	说    明 : EventRecorder功能测试
*	修改记录 : 
*		版本号    日期        作者     说明
*		V1.0    2018-06-13   armfly    首发
*
*	Copyright (C), 2018-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
#include "bsp.h"
#include "EventRecorder.h"




/* 定时器频率，500Hz */
#define  timerINTERRUPT_FREQUENCY	500

/* 中断优先级 */
#define  timerHIGHEST_PRIORITY		10

	
/*
*********************************************************************************************************
*	函 数 名: vEventRecorderTest
*	功能说明: 创建定时器
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void vEventRecorderTest(void)
{
	bsp_SetTIMforInt(TIM6, timerINTERRUPT_FREQUENCY, timerHIGHEST_PRIORITY, 0);
	EventStartB(0);	
}

/*
*********************************************************************************************************
*	函 数 名: TIM6_DAC_IRQHandler
*	功能说明: TIM6定时中断服务程序
*	返 回 值: 无
*********************************************************************************************************
*/
void TIM6_DAC_IRQHandler(void)
{
	if((TIM6->SR & TIM_FLAG_UPDATE) != RESET)
	{
		EventStopB(0);	
		EventStartB(0);	
		
		/* 清除更新标志 */
		TIM6->SR = ~ TIM_FLAG_UPDATE;
	}
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
