/*
*********************************************************************************************************
*
*	模块名称 : SPI 从机
*	文件名称 : demo_spi_slave.c
*	版    本 : V1.0
*	说    明 : SPI 从机
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2022-04-08 Eric2013  正式发布
*
*	Copyright (C), 2020-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _SFDEMO_H
#define _SFDEMO_H

/* 供外部调用的函数声明 */
void DemoSpiSlave(void);

#endif


