/*
*********************************************************************************************************
*
*	模块名称 : 利用STM32F4内部TIM输出PWM信号，顺便实现
*	文件名称 : bsp_tim_pwm.h
*	版    本 : V1.0
*	说    明 : 头文件
*
*	Copyright (C), 2012-2013, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef __BSP_HRTIM_PWM_H
#define __BSP_HRTIM_PWM_H

void bsp_SetHRTIMOutPWM(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
