/*
*********************************************************************************************************
*
*	模块名称 : AD7606模块。
*	文件名称 : sfDemo.h
*	版    本 : V1.0
*	说    明 : 头文件
*	修改记录 :
*		版本号  日期       作者    说明
*		v1.0    2020-05-01 armfly  首发。
*
*	Copyright (C), 2020-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _DMEO_FMC_AD7606_H
#define _DMEO_FMC_AD7606_H

/* 供外部调用的函数声明 */
void DemoFmcAD7606(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
